<h1><center> BizzAppDev Systems Pvt. Ltd.</center></h1>

# 5. Provide a program to create tables (Employee, Department, Project) in database Sqlite and insert the data.
• Make sure to add basic field, with employee to department and project relation.</br>
• Make sure maintain M2M relation between employee and project.</br>

In [1]:
import pandas as pd
import sqlite3

In [2]:
con = sqlite3.connect('BizzAppDev.db')
cur = con.cursor()

# Employee Table
cur.execute("""CREATE TABLE Employee(Emp_Id INTEGER PRIMARY KEY AUTOINCREMENT,
            first_name TEXT NOT NULL,
            last_name TEXT NOT NULL,
            Dept_Id INTEGER,
            salary REAL NOT NULL,
            DOJ date NOT NULL,
            country TEXT NOT NULL,
            CONSTRAINT fk_dept
            FOREIGN KEY (Dept_Id)
            REFERENCES Department(Dept_Id))""");


cur.execute('''INSERT INTO Employee VALUES
            (2448,"Preyas","Chaudhari",22,55000,'14-07-2020', 'IND')''');
cur.execute('''INSERT INTO Employee VALUES
            (2445,"AARU",'Shinde',21,55060,'25-08-2019', 'IND')''');
cur.execute('''INSERT INTO Employee VALUES
            (2446,"Ajay",'Patil',24,55060,'09-07-2019', 'IND')''');
cur.execute('''INSERT INTO Employee VALUES
            (2447,"Shubham",'Koli',23,55060,'25-06-2020', 'IND')''');

con.commit()

In [3]:
for row in cur.execute('''SELECT * FROM  Employee'''):
    print(row)

(2445, 'AARU', 'Shinde', 21, 55060.0, '25-08-2019', 'IND')
(2446, 'Ajay', 'Patil', 24, 55060.0, '09-07-2019', 'IND')
(2447, 'Shubham', 'Koli', 23, 55060.0, '25-06-2020', 'IND')
(2448, 'Preyas', 'Chaudhari', 22, 55000.0, '14-07-2020', 'IND')

In [4]:
# Department Table
cur = con.cursor()
cur.execute("""CREATE TABLE Department(Dept_Id INTEGER PRIMARY KEY AUTOINCREMENT,
                    D_Name varchar(50),
                    DOE date)""");
cur.execute('''INSERT INTO Department VALUES
            (21,"Account","02-08-2090")''');
cur.execute('''INSERT INTO Department VALUES
            (22,"Sales","12-03-2080")''');
cur.execute('''INSERT INTO Department VALUES
            (23,"QA TEAM","02-08-2090")''');
cur.execute('''INSERT INTO Department VALUES
            (24,"Software Tester","12-03-2080")''');
con.commit()

In [5]:
for row in cur.execute('''SELECT * FROM  Department'''):
    print(row)

(21, 'Account', '02-08-2090')
(22, 'Sales', '12-03-2080')
(23, 'QA TEAM', '02-08-2090')
(24, 'Software Tester', '12-03-2080')

In [6]:
# Project Table
cur = con.cursor()
cur.execute("""CREATE TABLE Project(Emp_Id INTEGER,
            Prjt_Id INTEGER PRIMARY KEY AUTOINCREMENT,
            project_name TEXT NOT NULL,
            CONSTRAINT fk_emp
            FOREIGN KEY (Emp_Id)
            REFERENCES Employee(Emp_Id))""");

cur.execute('''INSERT INTO Project VALUES
            (2445,123,"Alpha1")''');
cur.execute('''INSERT INTO Project VALUES
            (2446,124,"Alpha2")''');
cur.execute('''INSERT INTO Project VALUES
            (2447,125,"Alpha3")''');
cur.execute('''INSERT INTO Project VALUES
            (2448,126,"Alpha4")''');
con.commit()

In [7]:
for row in cur.execute('''SELECT * FROM  Project'''):
    print(row)

(2445, 123, 'Alpha1')
(2446, 124, 'Alpha2')
(2447, 125, 'Alpha3')
(2448, 126, 'Alpha4')

In [8]:
filtered_data = pd.read_sql_query("""SELECT * FROM Employee WHERE salary > 50000""", con)

In [9]:
filtered_data.sample(4)

   Emp_Id first_name  last_name  Dept_Id   salary         DOJ country
0    2445       AARU     Shinde       21  55060.0  25-08-2019     IND
3    2448     Preyas  Chaudhari       22  55000.0  14-07-2020     IND
1    2446       Ajay      Patil       24  55060.0  09-07-2019     IND
2    2447    Shubham       Koli       23  55060.0  25-06-2020     IND

In [10]:
filtered_data = pd.read_sql_query("""SELECT * FROM Project """, con)
filtered_data.head()

   Emp_Id  Prjt_Id project_name
0    2445      123       Alpha1
1    2446      124       Alpha2
2    2447      125       Alpha3
3    2448      126       Alpha4

In [14]:
filtered_data = pd.read_sql_query("""SELECT * FROM Department """, con)
filtered_data.head()

   Dept_Id           D_Name         DOE
0       21          Account  02-08-2090
1       22            Sales  12-03-2080
2       23          QA TEAM  02-08-2090
3       24  Software Tester  12-03-2080

### MANY 2 MANY (M2M) Between Employee and Project

In [12]:
cur = con.cursor()
cur.execute("""CREATE TABLE Employee_Project(Em_Pr_Id INTEGER PRIMARY KEY AUTOINCREMENT,
            Prjt_Id INTEGER,
            Emp_Id INTEGER,
            CONSTRAINT fk_Em_Pr
            FOREIGN KEY (Emp_Id)
            REFERENCES Employee(Emp_Id),
            CONSTRAINT fk_Pr
            FOREIGN KEY (Prjt_Id) 
            REFERENCES Project(Prjt_Id))""");

cur.execute('''INSERT INTO Employee_Project VALUES
            (1,2445,123)''');
cur.execute('''INSERT INTO Employee_Project VALUES
            (2,2445,124)''');
cur.execute('''INSERT INTO Employee_Project VALUES
            (3,2446,124)''');
cur.execute('''INSERT INTO Employee_Project VALUES
            (4,2447,125)''');
cur.execute('''INSERT INTO Employee_Project VALUES
            (5,2448,123)''');
cur.execute('''INSERT INTO Employee_Project VALUES
            (6,2447,126)''');
con.commit()

In [15]:
filtered_data = pd.read_sql_query("""SELECT * FROM Employee_Project """, con)
filtered_data.head()

   Em_Pr_Id  Prjt_Id  Emp_Id
0         1     2445     123
1         2     2445     124
2         3     2446     124
3         4     2447     125
4         5     2448     123